In [12]:
# vectorized operations
import numpy as np

# dataframe manipulation
import pandas as pd

# visualizations
import matplotlib.pyplot as plt
import seaborn as sns

# stats
import scipy.stats as stats

# stock datasets
from pydataset import data

# manipulation of time data
from datetime import date

# modeling preparation/data cleaning
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer

# filter out warnings
import warnings
warnings.filterwarnings('ignore')

# env (personal) function for sql db access
from env import get_db_url, user, password, host

# internal acquire method
import acquire

# show all columns for df.head()
pd.set_option("display.max_columns", None)
#pd.set_option("display.max_rows", None)

In [3]:
# 1. Read the data from attendance table and calculate attendance percentages. One half day is worth 50% of a full
# day, 10 tardies = to one absence
td_url = get_db_url('tidy_data')

In [27]:
query = 'SELECT * FROM attendance'
td_att = pd.read_sql(query, td_url)

In [28]:
td_att

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [29]:
td_att = td_att.melt(id_vars='Unnamed: 0')

In [30]:
td_att = td_att.rename(columns={'Unnamed: 0': 'Student', 'variable': 'date'})

In [31]:
td_att

   Student        date value
0    Sally  2018-01-01     P
1     Jane  2018-01-01     A
2    Billy  2018-01-01     A
3     John  2018-01-01     P
4    Sally  2018-01-02     T
5     Jane  2018-01-02     P
6    Billy  2018-01-02     T
7     John  2018-01-02     T
8    Sally  2018-01-03     T
9     Jane  2018-01-03     T
10   Billy  2018-01-03     A
11    John  2018-01-03     H
12   Sally  2018-01-04     H
13    Jane  2018-01-04     T
14   Billy  2018-01-04     A
15    John  2018-01-04     P
16   Sally  2018-01-05     P
17    Jane  2018-01-05     T
18   Billy  2018-01-05     H
19    John  2018-01-05     P
20   Sally  2018-01-06     A
21    Jane  2018-01-06     T
22   Billy  2018-01-06     T
23    John  2018-01-06     T
24   Sally  2018-01-07     T
25    Jane  2018-01-07     A
26   Billy  2018-01-07     P
27    John  2018-01-07     P
28   Sally  2018-01-08     T
29    Jane  2018-01-08     T
30   Billy  2018-01-08     T
31    John  2018-01-08     P

In [32]:
td_att['value'] = td_att.value.map({'P': 1, 'T': .9, 'H': .5, 'A': 0})

In [37]:
attendance = td_att.groupby(by='Student').value.mean()

In [38]:
attendance

Student
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: value, dtype: float64

In [39]:
# 2. Read coffee_levels table, transform data so that each carafe is in it's own column
query = 'SELECT * FROM coffee_levels'
coffee = pd.read_sql(query, td_url)

In [41]:
coffee

    hour coffee_carafe  coffee_amount
0      8             x       0.816164
1      9             x       0.451018
2     10             x       0.843279
3     11             x       0.335533
4     12             x       0.898291
5     13             x       0.310711
6     14             x       0.507288
7     15             x       0.215043
8     16             x       0.183891
9     17             x       0.391560
10     8             y       0.189297
11     9             y       0.521502
12    10             y       0.023163
13    11             y       0.235529
14    12             y       0.017009
15    13             y       0.997464
16    14             y       0.058361
17    15             y       0.144644
18    16             y       0.544676
19    17             y       0.594126
20     8             z       0.999264
21     9             z       0.915990
22    10             z       0.144928
23    11             z       0.311495
24    12             z       0.771947
25    13             z       0.398520
26    14             z       0.864464
27    15             z       0.436364
28    16             z       0.280621
29    17             z       0.436677

In [44]:
coffee = coffee.pivot_table(index='hour', columns='coffee_carafe', values='coffee_amount')

In [45]:
coffee

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

In [51]:
coffee.reset_index(inplace=True)

In [55]:
coffee = coffee.drop(columns=['level_0', 'index'])

coffee_carafe  hour         x         y         z
0                 8  0.816164  0.189297  0.999264
1                 9  0.451018  0.521502  0.915990
2                10  0.843279  0.023163  0.144928
3                11  0.335533  0.235529  0.311495
4                12  0.898291  0.017009  0.771947
5                13  0.310711  0.997464  0.398520
6                14  0.507288  0.058361  0.864464
7                15  0.215043  0.144644  0.436364
8                16  0.183891  0.544676  0.280621
9                17  0.391560  0.594126  0.436677

In [57]:
coffee.columns.name = ''

In [60]:
coffee

   hour         x         y         z
0     8  0.816164  0.189297  0.999264
1     9  0.451018  0.521502  0.915990
2    10  0.843279  0.023163  0.144928
3    11  0.335533  0.235529  0.311495
4    12  0.898291  0.017009  0.771947
5    13  0.310711  0.997464  0.398520
6    14  0.507288  0.058361  0.864464
7    15  0.215043  0.144644  0.436364
8    16  0.183891  0.544676  0.280621
9    17  0.391560  0.594126  0.436677

In [61]:
# This is a useful shape if people want to look at the data for themselves, but probably not the best shape to use
# for modeling

In [62]:
# 3. Read the cake_recipes table
query = 'SELECT * FROM cake_recipes'
cakes = pd.read_sql(query, td_url)

In [63]:
cakes

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084
5           c:top  71.306308  82.795477  92.098049  53.960273
6        d:bottom  52.799753  58.670419  51.747686  56.183110
7           d:top  96.873178  76.101363  59.571620  50.971626

In [65]:
cakes = cakes.melt(id_vars='recipe:position')

In [71]:
cakes['recipe'] = cakes['recipe:position'].str.split(':').str[0]

In [73]:
cakes['position'] = cakes['recipe:position'].str.split(':').str[1]

In [75]:
cakes = cakes.drop(columns='recipe:position')

In [79]:
# cakes.pivot_table(values='value', columns='variable', index=['recipe', 'position'])

variable               225        250        275        300
recipe position
a      bottom    61.738655  53.912627  74.414730  98.786784
       top       51.709751  52.009735  68.576858  50.228470
b      bottom    57.095320  61.904369  61.196980  99.248541
       top       82.455004  95.224151  98.594881  58.169349
c      bottom    96.470207  52.001358  92.893227  65.473084
       top       71.306308  82.795477  92.098049  53.960273
d      bottom    52.799753  58.670419  51.747686  56.183110
       top       96.873178  76.101363  59.571620  50.971626

In [85]:
cakes.columns = ['oven_temp', 'score', 'recipe', 'oven_position']

In [87]:
cakes = cakes[['recipe', 'oven_position', 'oven_temp', 'score']]

In [91]:
cakes

   recipe oven_position oven_temp      score
0       a        bottom       225  61.738655
1       a           top       225  51.709751
2       b        bottom       225  57.095320
3       b           top       225  82.455004
4       c        bottom       225  96.470207
5       c           top       225  71.306308
6       d        bottom       225  52.799753
7       d           top       225  96.873178
8       a        bottom       250  53.912627
9       a           top       250  52.009735
10      b        bottom       250  61.904369
11      b           top       250  95.224151
12      c        bottom       250  52.001358
13      c           top       250  82.795477
14      d        bottom       250  58.670419
15      d           top       250  76.101363
16      a        bottom       275  74.414730
17      a           top       275  68.576858
18      b        bottom       275  61.196980
19      b           top       275  98.594881
20      c        bottom       275  92.893227
21      c           top       275  92.098049
22      d        bottom       275  51.747686
23      d           top       275  59.571620
24      a        bottom       300  98.786784
25      a           top       300  50.228470
26      b        bottom       300  99.248541
27      b           top       300  58.169349
28      c        bottom       300  65.473084
29      c           top       300  53.960273
30      d        bottom       300  56.183110
31      d           top       300  50.971626

In [99]:
# C. Which, on average, is the best recipe?
cakes.groupby(by='recipe').score.mean().idxmax()
# Recipe b performs the best overall

'b'

In [98]:
# D. Which oven temp., on average, produces the best results?
cakes.groupby(by='oven_temp').score.mean()
# 275 degrees performs the best on average

oven_temp
225    71.306022
250    66.577437
275    74.886754
300    66.627655
Name: score, dtype: float64

In [100]:
# E. What combination produces the best results?
winner = cakes[cakes.score.max() == cakes.score]
winner

   recipe oven_position oven_temp      score
26      b        bottom       300  99.248541

In [101]:
# 4. Bonus: Explore other tables in tidy_data and reshape them as necessary so they are in tidy format

In [103]:
query = 'SELECT * FROM pew'
pew = pd.read_sql(query, td_url)

In [104]:
pew

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [106]:
pew = pew.melt(id_vars='religion')

In [112]:
pew.columns = ['Religion', 'Income', 'Frequency']

                  Religion              Income  Frequency
0                 Agnostic               <$10k         27
1                  Atheist               <$10k         12
2                 Buddhist               <$10k         27
3                 Catholic               <$10k        418
4       Don’t know/refused               <$10k         15
..                     ...                 ...        ...
175               Orthodox  Don't know/refused         73
176        Other Christian  Don't know/refused         18
177           Other Faiths  Don't know/refused         71
178  Other World Religions  Don't know/refused          8
179           Unaffiliated  Don't know/refused        597

[180 rows x 3 columns]

         Religion              Amount  Frequency
18       Agnostic             $10-20k         34
126      Agnostic           $100-150k        109
36       Agnostic             $20-30k         60
54       Agnostic             $30-40k         81
72       Agnostic             $40-50k         76
..            ...                 ...        ...
107  Unaffiliated             $50-75k        528
125  Unaffiliated            $75-100k        407
17   Unaffiliated               <$10k        217
161  Unaffiliated               >150k        258
179  Unaffiliated  Don't know/refused        597

[180 rows x 3 columns]